sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
						case Subcmd_Get_LowBat_Data:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_LowBat_Data;
							xFer[3] = flash_IgEvent[NUM_12V_startup];
							xFer[4] = flash_IgEvent[NUM_12V_shutdown];
							xFer[5] = flash_IgEvent[NUM_24V_startup];
							xFer[6] = flash_IgEvent[NUM_24V_shutdown];
							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + IGN_SCMD14_LEN;
							aewin_dbg("\n\rGet low battery data: %x %x %x %x", xFer[3], xFer[4], xFer[5], xFer[6]);
							break;

						case Subcmd_Set_LowBat_Data:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + IGN_SCMD15_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + IGN_SCMD15_LEN)])) break;
							flash_IgEvent[NUM_12V_startup] = recv1[5];
							flash_IgEvent[NUM_12V_shutdown] = recv1[6];
							flash_IgEvent[NUM_24V_startup] = recv1[7];
							flash_IgEvent[NUM_24V_shutdown] = recv1[8];
							aewin_dbg("\n\rGet low battery data: %x %x %x %x", recv1[5], recv1[6], recv1[7], recv1[8]);
							break;

						case Subcmd_Get_InVol_Limit:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_InVol_Limit;
							xFer[3] = flash_IgEvent[NUM_InVol_limit_min];
							xFer[4] = flash_IgEvent[NUM_InVol_limit_max];
							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + IGN_SCMD16_LEN;
							aewin_dbg("\n\rGet input voltage limit: %d V ~ %d V", xFer[3], xFer[4]);
							break;

						case Subcmd_Set_InVol_Limit:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + IGN_SCMD17_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + IGN_SCMD17_LEN)])) break;
							flash_IgEvent[NUM_InVol_limit_min] = recv1[5];
							flash_IgEvent[NUM_InVol_limit_max] = recv1[6];
							aewin_dbg("\n\rSet input voltage limit: %d V ~ %d V", flash_IgEvent[NUM_power_on_time], flash_IgEvent[NUM_power_off_time]);
							break;

						case Subcmd_Get_PwrOn_DelayT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_PwrOn_DelayT;
							xFer[3] = flash_IgEvent[NUM_power_on_time];
							xFer[4] = flash_IgEvent[NUM_power_off_time];
							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + IGN_SCMD18_LEN;
							aewin_dbg("\n\rGet power delay time. power on: %d, power off: %d", xFer[3], xFer[4]);
							break;

						case Subcmd_Set_PwrOn_DelayT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + IGN_SCMD19_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + IGN_SCMD19_LEN)])) break;
							flash_IgEvent[NUM_power_on_time] = recv1[5];
							flash_IgEvent[NUM_power_off_time] = recv1[6];
							aewin_dbg("\n\rSet power delay time. power on: %d, power off: %d", flash_IgEvent[NUM_power_on_time], flash_IgEvent[NUM_power_off_time]);
							break;

						case Subcmd_Get_Alarm_Stat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_Alarm_Stat;
							xFer[3] = flash_IgEvent[NUM_alarm_status];
							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + IGN_SCMD20_LEN;
							aewin_dbg("\n\rGet alarm status: %x", xFer[3]);
							break;

						case Subcmd_Set_Alarm_Stat:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + IGN_SCMD21_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + IGN_SCMD21_LEN)])) break;
							flash_IgEvent[NUM_alarm_status] = recv1[5];
							aewin_dbg("\n\rSet alarm status: %d", flash_IgEvent[NUM_alarm_status]);
							break;

						case Subcmd_Get_RTC_LocalT:
							//0x10 0x20?
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
							HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN);
							xFer[2] = Subcmd_Get_RTC_LocalT;
							//xFer[3] = sDate.Year; 		// Year low byte.
							//xFer[4] = 20; 				// Year high byte.
							//xFer[5] = sDate.Month;		// Month.
							//xFer[6] = sDate.Date;		// Date.
							xFer[3] = sTime.Hours;		// Hours.
							xFer[4] = sTime.Minutes;	// Minutes.
							xFer[5] = sTime.Seconds;	// Seconds.
							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + IGN_SCMD22_LEN;
							aewin_dbg("\n\rGet RTC local time: %2d:%2d:%2d",sTime.Hours ,sTime.Minutes, sTime.Seconds);
							//aewin_dbg("\n\rGet Date: 20%2d_%2d_%2d  Weekday:%d",sDate.Year ,sDate.Month, sDate.Date ,sDate.WeekDay);
							break;

						case Subcmd_Set_RTC_LocalT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + IGN_SCMD23_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + IGN_SCMD23_LEN)])) break;
							sTime.Hours = recv1[5];		// Hours.
							sTime.Minutes = recv1[6];	// Minutes.
							sTime.Seconds = recv1[7];	// Seconds.
							HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
							aewin_dbg("\n\rSet RTC local time: %2d:%2d:%2d", sTime.Hours, sTime.Minutes, sTime.Seconds);
							break;

						case Subcmd_Get_RTC_AlarmT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							rtc_alarm = sAlarm.AlarmTime;
							xFer[2] = Subcmd_Get_RTC_AlarmT;
							xFer[3] = flash_IgEvent[NUM_RTC_AlarmT_hour];
							xFer[4] = flash_IgEvent[NUM_RTC_AlarmT_min];
							xFer[5] = flash_IgEvent[NUM_RTC_AlarmT_sec];
							xFer[3] = rtc_alarm.Hours;
							xFer[4] = rtc_alarm.Minutes;
							xFer[5] = rtc_alarm.Seconds;
							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + IGN_SCMD24_LEN;
							aewin_dbg("\n\rGet RTC alarm time: %d : %d : %d", xFer[3],xFer[4], xFer[5]);
							break;

						case Subcmd_Set_RTC_AlarmT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + IGN_SCMD25_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + IGN_SCMD25_LEN)])) break;
							flash_IgEvent[NUM_RTC_AlarmT_hour] = recv1[5];		// Hours.
							flash_IgEvent[NUM_RTC_AlarmT_min] = recv1[6];	// Minutes.
							flash_IgEvent[NUM_RTC_AlarmT_sec] = recv1[7];	// Seconds.
							rtc_alarm.Hours = recv1[5];
							rtc_alarm.Minutes = recv1[6];
							rtc_alarm.Seconds = recv1[7];
							sAlarm.AlarmTime = rtc_alarm;
							HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
							aewin_dbg("\n\rSet RTC alarm time: %d : %d : %d", flash_IgEvent[NUM_RTC_AlarmT_hour], flash_IgEvent[NUM_RTC_AlarmT_min], flash_IgEvent[NUM_RTC_AlarmT_sec]);
							break;

						case Subcmd_Get_RTC_WakeT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_RTC_WakeT;
							xFer[3] = flash_IgEvent[NUM_RTC_WakeT_hour];
							xFer[4] = flash_IgEvent[NUM_RTC_WakeT_min];
							xFer[5] = flash_IgEvent[NUM_RTC_WakeT_sec];
							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + IGN_SCMD26_LEN;
							aewin_dbg("\n\rGet RTC wake time: %d : %d : %d", xFer[3],xFer[4], xFer[5]);
							break;

