sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
						case Subcmd_Set_RTC_WakeT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + IGN_SCMD27_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + IGN_SCMD27_LEN)])) break;
							flash_IgEvent[NUM_RTC_WakeT_hour] = recv1[5];		// Hours.
							flash_IgEvent[NUM_RTC_WakeT_min] = recv1[6];	// Minutes.
							flash_IgEvent[NUM_RTC_WakeT_sec] = recv1[7];	// Seconds.
							aewin_dbg("\n\rSet RTC wake time: %d : %d : %d", flash_IgEvent[NUM_RTC_WakeT_hour], flash_IgEvent[NUM_RTC_WakeT_min], flash_IgEvent[NUM_RTC_WakeT_sec]);
							break;

						case Subcmd_Get_Host_WTGT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_Get_Host_WTGT;
							xFer[3] = flash_IgEvent[NUM_Host_WTGT];
							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + IGN_SCMD40_LEN;
							aewin_dbg("\n\rGet host WDT time: %d", xFer[3]);
							break;

						case Subcmd_Set_Host_WTGT:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + IGN_SCMD41_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + IGN_SCMD41_LEN)])) break;
							flash_IgEvent[NUM_Host_WTGT] = recv1[5];
							aewin_dbg("\n\rSet host WDT time: %d", flash_IgEvent[NUM_Host_WTGT]);
							break;

						//-----------------------------------------------------
						default:
							break;
					}
					break;

				//-----------------------------------------------------
				case M_CMD_4G_SETTING:
					switch(recv1[CMD_SCMD_POS]){
						case Subcmd_TeleComm_Event:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
							HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN);
							xFer[2] = Subcmd_TeleComm_Event;
							xFer[3] = sDate.Year; 		// Year low byte.
							xFer[4] = 20; 				// Year high byte.
							xFer[5] = sDate.Month;		// Month.
							xFer[6] = sDate.Date;		// Date.
							xFer[7] = sTime.Hours;		// Hours.
							xFer[8] = sTime.Minutes;	// Minutes.
							xFer[9] = sTime.Seconds;	// Seconds.
							xFer[10] = flash_IgEvent[NUM_ig_states];	    // Ignition status.
							xFer[11] = flash_IgEvent[NUM_shutdown_delay];	// Ignition Shutdown Count.

							if(current_IgEvent[NUM_ig_states] == IG_Start_Up)           //Ignition On/Off Status
							{
								xFer[12] = 0x01;
							}
							else
							{
								xFer[12] = 0x00;
							}

							xFer[13] = 0x00;                                // Restart Failed &  Retry Times


							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE +  W4G_SCMD10_LEN;
							aewin_dbg("\n\rGet Telecommunication Event.");
							break;
						//-----------------------------------------------------
						default:
							break;
					}
					break;

				//-----------------------------------------------------
				default:
					break;

			}

			if(TRUE == send2host){
				xFer[MCU_ID_POS] = MCU_REPO_ID;
				switch(recv1[CMD_MCMD_POS]){
					//-----------------------------------------------------
					case M_CMD_MCU_SETTING:
						xFer[1] = M_CMD_MCU_SETTING;
						break;
					//-----------------------------------------------------
					case M_CMD_IG_SETTING:
						xFer[1] = M_CMD_IG_SETTING;
						break;

					//-----------------------------------------------------
					case M_CMD_4G_SETTING:
						xFer[1] = M_CMD_4G_SETTING;
						break;
				}

				xFer[xFer_len] = CMD_ETX_CODE; 		// ETX code.
				xFer[xFer_len + 1] = 0x00; 			// Check sum.
				xFer[xFer_len + 2] = CMD_EOT_CODE;	// EOT code.
				xFer_len += CMD_TAIL_SIZE;
				// Start to transmit to host.
				HAL_UART_Transmit_DMA(&huart1, xFer, xFer_len);
				send2host = FALSE;
				xFer_len = 0;
			}
		}
		//taskEXIT_CRITICAL();
		memset(recv1, 0, CMD_MAX_LEN);
		osDelay(UART1_TASK_ENTRY_TIME);
	}


  /* USER CODE END usart1_entry */
}

/* usart2_entry function */
void usart2_entry(void const * argument)
{
  /* USER CODE BEGIN usart2_entry */
	uint8_t recv2[UART2_RX_LENGTH] = {0};
	char split_count;
	uint16_t latitude, longitude;
	uint8_t latitude_index=0, longitude_index=0;


	int i;

	// Check register status
	HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Check_Status], sizeof(uart_Tx[ATCMD_Check_Status])-1, 30);
	HAL_UART_Transmit(&huart2, "\r", 1, 30);

	if(HAL_UART_Receive_DMA(&huart2, recv2, 64) != HAL_OK)
	  {
	    //Error_Handler();
	  }
	osDelay(UART2_ATCMD_DELAY);
	HAL_UART_Abort_IT(&huart2);

	/*
	for(i=0;i<UART2_RX_LENGTH;i++)
	{
		aewin_dbg("%c",recv2[i]);
	}
	aewin_dbg("\n");
	*/

	// Get IP
	HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Get_IP], sizeof(uart_Tx[ATCMD_Get_IP])-1, 30);
	HAL_UART_Transmit(&huart2, "\r", 1, 30);

	if(HAL_UART_Receive_DMA(&huart2, recv2, 64) != HAL_OK)
	  {
		//Error_Handler();
	  }
	osDelay(UART2_ATCMD_DELAY);
	HAL_UART_Abort_IT(&huart2);

	// Check IP
	HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Check_APNIP], sizeof(uart_Tx[ATCMD_Check_APNIP])-1, 30);
	HAL_UART_Transmit(&huart2, "\r", 1, 30);

	if(HAL_UART_Receive_DMA(&huart2, recv2, 64) != HAL_OK)
	  {
		//Error_Handler();
	  }
	osDelay(UART2_ATCMD_DELAY);
	HAL_UART_Abort_IT(&huart2);

	// Check signal
	HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Check_Signal], sizeof(uart_Tx[ATCMD_Check_Signal])-1, 30);
	HAL_UART_Transmit(&huart2, "\r", 1, 30);

	if(HAL_UART_Receive_DMA(&huart2, recv2, 64) != HAL_OK)
	  {
		//Error_Handler();
	  }
	osDelay(UART2_ATCMD_DELAY);
	HAL_UART_Abort_IT(&huart2);

	// Enable GPS
	HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Enable_GPS], sizeof(uart_Tx[ATCMD_Enable_GPS])-1, 30);
	HAL_UART_Transmit(&huart2, "\r", 1, 30);

	if(HAL_UART_Receive_DMA(&huart2, recv2, 64) != HAL_OK)
	  {
		//Error_Handler();
	  }
	osDelay(UART2_ATCMD_DELAY);
	HAL_UART_Abort_IT(&huart2);


	// Enable the NMEA $RMC messages
	HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Enable_RMC], sizeof(uart_Tx[ATCMD_Enable_RMC])-1, 30);
	HAL_UART_Transmit(&huart2, "\r", 1, 30);

	if(HAL_UART_Receive_DMA(&huart2, recv2, 64) != HAL_OK)
	  {
		//Error_Handler();
	  }
	osDelay(UART2_ATCMD_DELAY);
	HAL_UART_Abort_IT(&huart2);

	//uint8_t recv2 = 0;
	//HAL_StatusTypeDef u2_states = HAL_OK;
    /* Infinite loop */
    for(;;)
    {
		/*if(HAL_UART_Receive_DMA(&huart2, (uint8_t*)&recv2, 1) == HAL_OK){
			HAL_UART_Transmit_DMA(&huart2, (uint8_t*)&recv2, 1);
		}*/


    	/*##-2- Start the transmission process #####################################*/
    	  /* While the UART in reception process, user can transmit data through
    	     "aTxBuffer" buffer */
    	#if 0
    	if(HAL_UART_Transmit(&huart2, "+CSQ: 2,5", 10, 5000)!= HAL_OK)
    	  {
    	    Error_Handler();
    	  }


