sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
    	  /*##-3- Put UART peripheral in reception process ###########################*/
    	  if(HAL_UART_Receive(&huart2, (uint8_t *)recv2, 10, 5000) != HAL_OK)
    	  {
    	    Error_Handler();
    	  }



    	  if(HAL_UART_Receive_IT(&huart2, (uint8_t*)&recv2, 10)!= HAL_OK)
    	{
    		Error_Handler();
    	}

    	while (UartReady != SET)
		  {
		  }
#endif



    	// Enable the NMEA $RMC messages
		HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Get_GPS_DATA], sizeof(uart_Tx[ATCMD_Get_GPS_DATA])-1, 30);
		HAL_UART_Transmit(&huart2, "\r", 1, 30);

		if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
		  {
			//Error_Handler();
		  }
		else
		{
			// find index of latitude and longitude
			split_count = 0;
			for(i = 0; i<UART2_RX_LENGTH; i++)
			{
				if(recv2[i] == ',')
				{
					split_count++;
				}

				if(split_count == 4)
				{
					latitude_index = i+1;
				}

				if(split_count == 6)
				{
					longitude_index = i+1;
					break;
				}
			}

			// Get latitude and longitude data
			latitude = 0;   //24
			longitude = 0;  //121
			if(recv2[latitude_index] != ',')
			{
				// latitude
				for( i = 0; i < 10; i++)
				{
					if(i < 4)
					{
						latitude = 10*latitude + recv2[latitude_index+i];
					}
					else if(i > 4)
					{
						latitude = 10*latitude + recv2[latitude_index+i-1];
					}
				}

				// longitude
				for( i = 0; i < 11; i++)
				{
					if(i < 5)
					{
						longitude = 10*longitude + recv2[longitude_index+i];
					}
					else if(i > 5)
					{
						longitude = 10*longitude + recv2[longitude_index+i-1];
					}
				}
			}

			// send data to queue
			if( osMessagePut(UART2_LAT_QHandle, latitude, osWaitForever) != osOK )
			{
				aewin_dbg("\n\rUART2 GPS latitude put Q failed. \r\n");
			}

			if( osMessagePut(UART2_LONG_QHandle, longitude, osWaitForever) != osOK )
			{
				aewin_dbg("\n\rUART2 GPS longitude put Q failed. \r\n");
			}


		}
		osDelay(UART2_ATCMD_DELAY);
		HAL_UART_Abort_IT(&huart2);


    	/*
    	if(HAL_UART_Receive_IT(&huart2, (uint8_t*)&recv2, 64) != HAL_OK)
    	  {
    	    //Error_Handler();
    	  }
    	else
    	{
    		// find index of latitude and longitude
    		split_count = 0;
    		for(i = 0; i<UART2_RX_LENGTH; i++)
    		{
    			if(recv2[i] == ',')
    			{
    				split_count++;
    			}

    			if(split_count == 4)
    			{
    				latitude_index = i+1;
    			}

    			if(split_count == 6)
    			{
    				longitude_index = i+1;
    				break;
    			}
    		}

    		// Get latitude and longitude data
    		latitude = 0;   //24
    		longitude = 0;  //121
    		if(recv2[latitude_index] != ',')
    		{
    			// latitude
    			for( i = 0; i < 10; i++)
    			{
    				if(i < 4)
    				{
    					latitude = 10*latitude + recv2[latitude_index+i];
    				}
    				else if(i > 4)
    				{
    					latitude = 10*latitude + recv2[latitude_index+i-1];
    				}
    			}

    			// longitude
    			for( i = 0; i < 11; i++)
				{
					if(i < 5)
					{
						longitude = 10*longitude + recv2[longitude_index+i];
					}
					else if(i > 5)
					{
						longitude = 10*longitude + recv2[longitude_index+i-1];
					}
				}
    		}

    		// send data to queue
    		if( osMessagePut(UART2_LAT_QHandle, latitude, osWaitForever) != osOK )
			{
				aewin_dbg("\n\rUART2 GPS latitude put Q failed. \r\n");
			}

			if( osMessagePut(UART2_LONG_QHandle, longitude, osWaitForever) != osOK )
			{
				aewin_dbg("\n\rUART2 GPS longitude put Q failed. \r\n");
			}


    	}



    	// Let this thread take a break.
		osDelay(30);
		// Abort UART processing.
		//HAL_UART_Abort_IT(&huart2);   //if add this line, UART can not get rx data


    	HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Get_GPS_DATA], sizeof(uart_Tx[ATCMD_Get_GPS_DATA])-1, 30);
    	//HAL_UART_Transmit(&huart2, "AT", 2, 30);
    	for(i = 0; i < 300; i++);
    	HAL_UART_Transmit(&huart2, "\r", 1, 30);
    	*/



    	/*
    	HAL_UART_Transmit(&huart2, "AT+cind?", 11, 30);
    	if(HAL_UART_Receive_IT(&huart2, (uint8_t*)&recv2, 2)==HAL_OK)
    	{
    		HAL_UART_Transmit(&huart2, "AAAAAA", 6, 30);
    	}
    	*/




#if 0
		if((u2_states = HAL_UART_Receive(&huart2, (uint8_t*)&recv2, 1, UART3_TIMEOUT)) == HAL_OK){
			HAL_UART_Transmit(&huart2, (uint8_t*)&recv2, 1, UART3_TIMEOUT);
		}
		else if (u2_states == HAL_TIMEOUT){
			HAL_UART_Abort(&huart2);
		}
#endif
		osDelay(50);
    }
  /* USER CODE END usart2_entry */
}

/* usart3_entry function */
void usart3_entry(void const * argument)
{
  /* USER CODE BEGIN usart3_entry */
	uint8_t recv3[4] = {0};
	int temp;
	uint8_t *cml_head, *cml_limit, *cml_ptr = cml_array;
	HAL_StatusTypeDef u3_states = HAL_OK;
	cml_head = cml_limit = cml_ptr;
	uint8_t cnt = 0;
	/* Infinite loop */
	for(;;)
	{
#if (0)
		//recv3[0] = recv3[1] = recv3[2] = 0;
		osMutexWait(MUTEX_DebugHandle, osWaitForever);
		if(HAL_UART_Receive(&huart3, (uint8_t*)&recv3[0], 1, 1) == HAL_OK){
			if (HAL_UART_Receive(&huart3, (uint8_t*)&recv3[1], 1, 1) != HAL_OK){
				switch(recv3[0]){
					case '\0':
						break;
					//-----------------------------------------------------
					case '\r':
					case '\n':
						HAL_UART_Transmit(&huart3, SVA_1000_NL, sizeof(SVA_1000_NL) - 1, sizeof(SVA_1000_NL) - 1);
						*cml_limit = '\0';
						osMutexWait(MUTEX_CMD_PROCHandle, osWaitForever);
						memcpy(cml_proc, cml_array, (uint32_t)(cml_limit - cml_head + 1));
						osMutexRelease(MUTEX_CMD_PROCHandle);
						cml_ptr = cml_limit = cml_head;

						break;

					//-----------------------------------------------------
					/* Delete Key. */
					case 0x7E:

						break;
					//-----------------------------------------------------
					case 0x7F:
						recv3[0] = '\b';

					case '\b':
						if ((cml_ptr > cml_head) && (cml_limit > cml_head)){
							temp = cml_limit - cml_ptr;
							*(--cml_ptr) = 0;
							strncpy(cml_ptr, (cml_ptr + 1), temp);
							HAL_UART_Transmit(&huart3, (uint8_t*)&recv3[0], 1, 1);
							HAL_UART_Transmit(&huart3, cml_ptr, temp, temp);
							HAL_UART_Transmit(&huart3, " ", 1, 1);
							//HAL_UART_Transmit(&huart3, (uint8_t*)&recv3[0], 1, UART3_TIMEOUT);


